#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main(void)
//{
//	int a = 0x11223344;//44 33 22 11小端（存储）模式，数据的低位保存在内存的低地址中。
//	return 0;          //11 22 33 44大端存储,数据的低位保存在内存的高地址中。
//}
//写一段代码告诉我们机器存储数据的字节序
//int main(void)
//{
//	int a = 1;
//	char* p = (char*)&a;//&a是int型，4个字节，char*只访问一个字节
//	if (*p == 1)
//	{
//		printf("XiaoDuan\n");
//	}
//	else
//	{
//		printf("DaDuan\n");
//	}
//	return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	//返回1：小端
//	//返回0：大端
//	return *(char*)&a;
//}
//
//int main(void)
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("XiaoDuan\n");
//	}
//	else
//	{
//		printf("DaDuan\n");
//	}
//	return 0;
//}

//int main(void)
//{
//	int a = 0x11223344;
//	char* p = &a;
//	*p = 0;
//	return 0;
//}

//int main(void)
//{
//	//1000 0000 0000 0000 0000 0000 0000 0001 -1原码
//	//1111 1111 1111 1111 1111 1111 1111 1110 -1反码
//	//1111 1111 1111 1111 1111 1111 1111 1111 -1补码
//	//char a = -1--->截断8位--->1111 1111
//	char a = -1;
//	//整型提升--->1111 1111 1111 1111 1111 1111 1111 1111(补码--->原码-1)
//	signed char b = -1;
//	//整型提升--->1111 1111 1111 1111 1111 1111 1111 1111(补码--->原码-1)
//	unsigned char c = -1;
//	//无符号unsigned char的整型提升（补0）--->0000 0000 0000 0000 0000 0000 1111 1111（补码=原码--->255）
//	printf("a=%d, b=%d, c=%d", a, b, c);//-1,-1,255
//	return 0;
//}

//int main(void)
//{
//	char a = -128;
//	//1000 0000 0000 0000 0000 0000 1000 0000（-128原码）
//	//1111 1111 1111 1111 1111 1111 0111 1111（-128反码）
//	//1111 1111 1111 1111 1111 1111 1000 0000（-128补码）
//	//char a = -128 截断--->1000 0000；
//	//char的整型提升--->1111 1111 1111 1111 1111 1111 1000 0000（补码）*
//	printf("%u\n", a);//打印十进制无符号数字，把*当成无符号数的补码，则补码等于原码--->4294967168
//	return 0;
//}